Revit 2027 API
BalusterInfo.BaseOffset Property
 The offset from the base reference.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BaseOffset { get; set; }
Public Property BaseOffset As Double
	Get
	Set
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
member BaseOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for baseOffset must be no more than 30000 feet in absolute value.
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace